---
type: INavisworksExporter
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# INavisworksExporter

`Autodesk.Revit.DB.INavisworksExporter` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Export | 2014 | `void Export ( Document document , string folder , string name , NavisworksExportOptions options )` |
| Method | ValidateExportOptions | 2014 | `bool ValidateExportOptions ( Document document , string folder , string name , NavisworksExportOptions options , out string exceptionMessage )` |